"CURRENT_LANGUAGE" = "Finnish";

"Documents" = "Dokumentit";
"Favorites" = "Suosikit";
"Preferences" = "Asetukset";
"Where" = "Missä";
"Terminal" = "Pääte";
"Find" = "Etsi";
"Music" = "Musiikki";
"Trash" = "Roskakori";
"Stop" = "Pysäytä";
"Help" = "Ohjeet";
"Find Text" = "Etsi teksti";
"Info" = "Tiedot";
"Pictures" = "Kuvat";
"Show" = "Näytä";
"Compress" = "Pakkaa";
"Open" = "Avaa";
"Computer" = "Tietokone";
"Disk Image" = "Levytiedosto";
"Delete" = "Poista";
"Move" = "Siirrä";
"New Folder" = "Uusi kansio";
"Finder" = "Finder";
"Copy" = "Kopioi";
"Desktop" = "Työpöytä";
"Duplicate" = "Monista";
"Public" = "Julkinen";
"Preview" = "Esikatselu";
"Decompress" = "Pura";
"Find/Stop" = "Etsi/Pysäytä";
"Eject" = "Anna levy";
"Applications" = "Ohjelmat";
"Home" = "Koti";
"Back" = "Takaisin";
"Movies" = "Elokuvat";

"Stop" = "Pysäytä";
"Copy" = "Kopioi";

"Cancel" = "Kumoa";
"OK" = "OK";

"Hide Invisible Files" = "Kätke näkymättömät kohteet";
"Hide Icons" = "Kätke kuvakkeet";
"Show Invisible Files" = "Näytä näkymättömät kohteet";
"Hide Desktop" = "Kätke Path Finderin työpöytä";
"Show Icons" = "Näytä kuvakkeet";
"Hide Preview" = "Kätke esikatselu";
"Show Desktop" = "Näytä Path Finderin työpöytä";
"Smart Sorting Off" = "Älä käytä älykästä lajittelua";
"Show Preview" = "Näytä esikatselu";

"Smart Sorting On" = "Käytä älykästä lajittelua";
"Generic Icons Off" = "Älä käytä geneerisiä kuvakkeita";
"Generic Icons On" = "Käytä geneerisiä kuvakkeita";
"Preview" = "Esikatselu";
"Update Database" = "Päivitä tietokanta";
"Updating..." = "Päivitetään...";
"Reveal in Finder" = "Näytä Finderissa";
"View as Hex" = "Näytä heksakoodi";
"Show in New Window" = "Näytä uudessa ikkunassa";
"Make Alias" = "Tee alias";
"Duplicate" = "Monista";

"Rename" = "Nimeä uudelleen";
"Move to Trash" = "Siirrä roskakoriin";
"Open with %@" = "Avaa ohjelmassa %@";
"Eject" = "Anna levy";
"Open" = "Avaa";
"Open with" = "Avaa ohjelmassa";
"Check your iTools settings in the Internet panel in the System Preferences application." = "Tarkista iTools-asetuksesi Järjestelmäasetusten Internet-paneelissa.";
"Initializing..." = "Initialisoidaan...";
"This beta version of Path Finder has expired.  Download the latest version from cocoatech.com." = "Tämä Path Finderin betaversio on vanhentunut. Imuroi uusin versio osoitteesta cocoatech.com.";
"Error getting iDisk user name and password" = "Virhe haettaessa iDisk-käyttäjänimeä ja -salasanaa";
"This is highly recommended.  You can always change this setting later from the preferences panel." = "Tämä on suositeltavaa. Voit koska tahansa muuttaa tätä asetusta Asetukset-ikkunassa";
"Quit" = "Lopeta";
"Don't Quit" = "Älä lopeta";
"Done" = "Valmis";
"If you keep Path Finder running all the time, it's always there when you need it!\r\rThis confirmation can be disabled from the preferences panel." = "Jos pidät Path Finderin päällä aina, se on aina auki kun tarvitset sitä!\r\rTämä vahvistus voidaan asettaa pois päältä Asetukset-ikkunassa.";
"No" = "Ei";
"Yes" = "Kyllä";
"Would you like Path Finder to launch automatically when you log in?" = "Haluatko Path Finderin aukeavan automaattisesti kun kirjaudut sisään?";
"Really Quit?" = "Haluatko varmasti lopettaa?";
"Expired" = "Vanhentunut";
"Image: " = "Kuva: ";
"to" = "kohteeseen";
"Stop" = "Pysäytä";
"Home" = "Koti";
"Find" = "Etsi";
"Computer" = "Tietokone";
"View as Hex" = "Näytä heksakoodi";
"Updating the database takes a few minutes to complete, but once done, makes finding files on your computer extremely fast" = "Tietokannan päivitys kestää joitakin minuutteja, mutta se tekee tiedostojen etsimisestä erittäin nopeaa.";

"Idle" = "Valmiudessa";
"Found: %d" = "Löytynyt: %d";
"Move to Trash" = "Siirrä roskakoriin";
"Open with %@" = "Avaa ohjelmassa %@";
"To get the most out of the Path Finder find feature, you need to build a locate database.  Click on the \"Update Database\" button in the Preferences panel to do this." = "Saadaksesi suurimman hyödyn Path Finderin hakutoiminnosta, sinun tulee rakentaa locate-tietokanta osoittamalla \"Päivitä tietokanta\"-painiketta Asetukset-ikkunassa.";
"Show in New Window" = "Näytä uudessa ikkunassa";
"Open" = "Avaa";

"Finding..." = "Etsitään...";
"Open with %@" = "Avaa ohjelmassa %@";
"Found: %d" = "Löytynyt: %d";
"Computer" = "Tietokone";
"%d items" = "%d kohdetta";
"Open with %@" = "Avaa ohjelmassa %@";
"%@ available, %@ used" = "%@ vapaana, %@ käytetty";

"link" = "link";
"The original file may have been moved or deleted." = "Alkuperäinen tiedosto on saatettu siirtää tai poistaa.";
"Could not resolve alias." = "Ei voitu ratkaista aliasta.";

"alias" = "alias";
"Error creating directory." = "Virhe luotaessa hakemistoa.";
"Write error." = "Virhe kirjoitettaessa.";
"Read error." = "Virhe luettaessa.";
"Error creating file." = "Virhe luotaessa tiedostoa.";
"Error creating symbolic link." = "Virhe luotaessa symbolista linkkiä.";
"There is no application available to open the document \"%@\"." = "Saatavilla ei ole ohjelmaa avaamaan dokumenttia \"%@\".";
"OK" = "OK";
"Alert!" = "Varoitus!";
"View Hex" = "Näytä heksakoodi";

"Computer" = "Tietokone";
"You do not have permission to trash this item." = "Sinulla ei ole riittäviä käyttöoikeuksia kohteen poistamiseksi.";
"copy" = "kopio";
"Trash operation could not be completed." = "Roskakorin tyhjennystä ei voitu suorittaa loppuun.";
"Choose a valid destination." = "Valitse validi sijoituskohde.";
"Compress..." = "Pakkaa...";
"Destination does not exist" = "Sijoituskohdetta ei ole";
"Decompress..." = "Pura...";
"Date Created" = "Luontipäivä";
"Kind" = "Laji";
"Date Modified" = "Muutospäivä";
"Name" = "Nimi";
"Size" = "Koko";
"Version" = "Versio";
"Replace All" = "Korvaa kaikki";
"Error!" = "Virhe!";
"Replace" = "Korvaa";
"Go Menu" = "Siirry-valikko";
"Building Menus" = "Valikkojen rakennus";
"Favorites Menu" = "Suosikit-valikko";
"Running Applications Menu" = "Käynnissä olevat ohjelmat -valikko";
"Applications Menu" = "Ohjelmavalikko";
"Developer" = "Kehittäjä";
"Float Window" = "Kelluta ikkunaa";
"Transparency" = "Läpinäkyvyys";
"Find" = "Etsi";
"Path" = "Polku";
"iDisk" = "iDisk";
"History" = "Historia";
"Path Finder was unable to automatically email the bug report.  Copy and paste the contents of this window and email it to bugs@cocoatech.com" = "Path Finder ei voinut automaattisesti lähettää bugiraporttia. Kopioi ja sijoita tämän ikkunan sisältö sähköpostiin ja lähetä se osoitteeseen bugs@cocoatech.com";
"Path Finder has encountered an unexpected error.  Please email this report to bugs@cocoatech.com so it can be fixed in the next release." = "Path Finder on kohdannut odottamattoman virheen. Ole hyvä ja lähetä tämä raportti osoitteeseen bugs@cocoatech.com jotta virhe voidaan korjata seuraavassa versiossa.";
"Bug Reporter" = "Bugin raportoija";
"Email Report" = "Sähköpostita raportti";

"Path Finder has been updated to version %@!" = "Path Finder on päivitetty versioon %@!";

"You are currently running version %@.  Download version %@ from www.cocoatech.com" = "Käytät tällä hetkellä versiota %@.  Hae versio %@ osoitteesta www.cocoatech.com";

"Update Now" = "Päivitä nyt";
"The item \"%@\" could not be moved to the trash." = "Kohdetta \"%@\" ei voitu siirtää roskakoriin.";
"Would you like to delete it immediately?" = "Haluatko poistaa sen välittömästi?";

"Label" = "Merkki";

"View" = "Sisältö";
"Dynamic" = "Sovita ikkunaan";

"Sort Ascending" = "Järjestä nousevasti";
"Sort Descending" = "Järjestä laskevasti";

"as Icons" = "kuvakkeina";
"as List" = "luettelona";
"as Columns" = "palstoina";

"Touch" = "Kosketa";

"Capacity:" = "Kapasiteetti:";
"Path:" = "Polku:";
"Volume:" = "Taltio:";
"Format:" = "Muoto:";
"Created:" = "Luotu:";
"Size:" = "Koko:";
"Free:" = "Vapaana:";
"Version:" = "Versio:";
"Modified:" = "Muutettu:";
"Kind:" = "Laji:";
"Resolved:" = "Ratkaistu:";

"Name:" = "Nimi:";
"Owner:" = "Omistaja:";
"Group:" = "Ryhmä:";
"Permission:" = "Käyttöoikeus:";
"Type:" = "Tyyppi:";
"Creator:" = "Luoja:";

"New File" = "Uusi tiedosto";
"Preview" = "Esikatselu";
"Forward" = "Seuraava";
"Mount Point:" = "Näkyviintuontikohta:";
"Device:" = "Laite:";
"MP3:" = "MP3:";

"Application:" = "Ohjelma:";

"Are you sure you want to remove the items in the Trash permanently?" = "Oletko varma, että haluat poistaa roskakorissa olevat kohteet lopullisesti?";
"You cannot undo this action." = "Roskakorin tyhjennystä ei voi perua.";

"Tool Drawer" = "Työkalut";
"Preview Drawer" = "Esikatselu";
"Busy" = "Aktiivinen";

"Local Disks" = "Paikallisilta levyiltä";
"Everywhere" = "Kaikkialta";

"Connect" = "Yhdistä";
"Hide" = "Kätke";
"Show" = "Näytä";
"Search" = "Etsi";

"Choose Volume" = "Valitse taltio";

"Hide %@" = "Kätke %@";
"Hide Others" = "Kätke muut";
"Show All" = "Näytä kaikki";

"Show Trash Can" = "Näytä roskakori";
"Hide Trash Can" = "Kätke roskakori";

"Go to Folder" = "Siirry kansioon";
"Go to the folder:" = "Siirry kansioon:";
"Go" = "Siirry";

/* Search Results for '.txt' in 'System' */
"Search Results for '%@' in '%@'" = "Hakutulokset sanalle '%@' kohteessa '%@'";

"Find String:" = "Hakusana:";
"Search Location:" = "Hakukohde:";

"An error occurred while trying to mount \"%@\"." = "Tapahtui virhe tuotaessa \"%@\" näkyviin.";
"An error occurred while trying to unmount \"%@\"." = "Tapahtui virhe poistettaessa \"%@\" näkyvistä.";
"An error occurred while trying to eject \"%@\"." = "Tapahtui virhe annettaessa levy \"%@\".";
"Error: %d" = "Virhe: %d";

"Really Open?" = "Avaa todella?";
"Do you want to open all %d items?" = "Haluatko avata kaikki %d kohdetta?";

"Searching..." = "Etsitään...";

"Encoding" = "Merkkikoodaus";
"Convert document to plain text?" = "Muunna dokumentti pelkäksi tekstiksi?";
"Converting will lose fonts, colors, and other text styles in the document." = "Muuntaminen poistaa kaikki kirjasimet, värit ja tyylittelyt dokumentista.";

"Text Editor" = "Tekstieditori";
"Play Sound" = "Soita ääni";

"Access" = "Pääsy";
"Access:" = "Pääsy:";
"Owner" = "Omistaja";
"Group" = "Ryhmä";

"Select a menu item and hit a command key sequence to modify.  Hit the delete key to clear." = "Valitse valikkokohde ja syötä haluttu komentonäppäinoikotie.  Paina poistonäppäintä poistaaksesi oikotien.";
"Menu" = "Valikko";
"Command" = "Komento";
"Menu Key Editor" = "Näppäinoikoteiden muokkaus";

"Welcome to Path Finder" = "Tervetuloa Path Finderiin";
"Buy Later" = "Myöhemmin";
"Buy Now" = "Osta nyt";
"Enter Registration Code" = "Syötä rekisteröintikoodi";
"%d days remaining" = "%d päivää jäljellä";
"Your support is greatly appreciated!  Path Finder is continually being updated and improved because of support from users like yourself." = "Arvostamme tukeasi suuresti! Path Finderia päivitetään ja parannetaan jatkuvasti kaltaistesi käyttäjien ansiosta. ";
"Purchase Path Finder today!" = "Osta Path Finder jo tänään!";
"%d day free trial" = "%d päivän ilmainen kokeiluversio";

"When you purchase Path Finder, you are sent a registration code.  Enter that code here along with the email address used when registering." = "Kun ostat Path Finderin, sinulle lähetetään rekisteröintikoodi.  Syötä kyseinen koodi sekä rekisteröinnissä käyttämäsi sähköpostiosoite allaoleviin kenttiin.";
"Email Address:" = "Sähköpostiosoite:";
"Registration Code:" = "Rekisteröintikoodi:";

"Invalid Registration Code!" = "Virheellinen rekisteröintikoodi!";
"Thank you for registering Path Finder!" = "Kiitos Path Finder -rekisteröinnistäsi!";
"This copy of Path Finder is not registered" = "Tätä Path Finderin kopiota ei ole rekisteröity";
"Close" = "Sulje";
"Font Sample" = "Kirjasinnäyte";

"View Text" = "Näytä teksti";
"Password" = "Salasana";

"Remove Top" = "Poista ylin";
"Remove All" = "Poista kaikki";
"New Shelf..." = "Uusi hylly...";
"Remove Shelf" = "Poista hylly";

"Standard" = "Standardi";
"Processes" = "Prosessit";
"Drop Stack" = "Pudotushylly";
"Process Drawer" = "Prosessit";
"Empty" = "Empty";
"Shelf" = "Shelf";

"Zoom In" = "Suurenna";
"Zoom Out" = "Pienennä";
"Go to Page" = "Siirry sivulle";
"Page %d of %d" = "Sivu %d/%d";

/* this was copied from Preview.app - open a PDF in Preview that needs a password */
"This PDF is password protected.  Without a password, some operations with this document will be restricted." = "Tämä PDF on salasanasuojattu. Ilman salasanaa tiettyjä toimintoja ei voida suorittaa tälle dokumentille.";
"To enable more operations, enter a password:" = "Mahdollistaaksesi lisää toimintoja, syötä salasana:";

"Summarize" = "Tee yhteenveto";
"Sentences" = "Lauseita";
"Paragraphs" = "Kappaleita";
"Shelf Name" = "Hyllyn nimi";
"Icon Size" = "Symbolien koko";
"Toggle Shelf" = "Näytä/kätke hylly";
"Activate URLs" = "Aktivoi URL:t";

"License Agreement" = "Lisenssisopimus";
"Agree" = "Hyväksy";
"Disagree" = "Hylkää";
"Clean up" = "Järjestele";

"Info" = "Tiedot";
"%d of %d items selected" = "%d/%d kohdetta valittu";
"Action" = "Toiminto";
"Remove Shelf?" = "Poista hylly?";
"Are you sure you want to remove the shelf named \"%@\"?" = "Haluatko varmasti poistaa hyllyn nimeltä \"%@\"?";

/* terminal toolbar buttons */
"Close" = "Sulje";
"New" = "Uusi";
"New Tab" = "Uusi välilehti";

"Do you really want to close this terminal session?" = "Haluatko varmasti sulkea tämän päätesession?";
"Closing this session will terminate the following processes inside it: " = "Tämän session sulkeminen lopettaa nämä session alaiset prosessit: ";
"Terminal Drawer" = "Päätevetolaatikko";

/* upgrade panel */
"upgrade message" = "On kulunut kaksi vuotta Path Finderin ensimmäisestä versiosta, ja jos olet ollut asiakkaana niistä päivistä lähtien, kun ohjelman nimi oli \"SNAX\", olet varmasti havainnut hyvin dramaattisia muutoksia!\r\rNyt version 3.0 yhteydessä veloitan päivittämisestä $9.  Tämä takaa, että voin jatkaa kehitystyötä ja viedä Path Finderin vieläkin korkeammalle tasolle.\r\rTeen Path Finderin parissa kokopäivätyötä, ja olen täysin sitoutunut parantamaan ohjelmaa dramaattisesti ja lisäämään paljon uusia ominaisuuksia seuraavien vuosien aikana!\r\rJos ostit Path Finderin alle 4 kuukautta sitten, lähetä minulle sähköpostia (englanniksi) saadaksesi ilmaisen päivityksen.\r\rKiitos tuestasi!\r\rSteve Gehrman\rCocoaTechin perustaja";
"Welcome to Path Finder 3.0 !!" = "Tervetuloa Path Finder 3.0:een !!";
"When upgrading, you will need your current registration information:" = "Päivittäessä tarvitset tämänhetkiset rekisteröintitietosi:";
"Email Sales" = "Sähköposti myyntiosastolle";
"Upgrade Now" = "Päivitä nyt";
"Email:" = "E-mail-osoite:";
"Code:" = "Koodi:";

"Secure Delete" = "Tiedostosilppuri";
"Secure delete overwrites files before deleting them.  Files are overwritten three times, first with the byte pattern 0xff, then 0x00, and then 0xff again." = "Tiedostosilppuri ylikirjoittaa tiedostot ennen niiden poistoa. Tiedostot ylikirjoitetaan kolmesti, käyttäen tavua 0xff, sitten 0x00, ja lopuksi uudelleen 0xff.";
"WARNING:  This action bypasses the Trash.  You cannot undo this action." = "VAROITUS:  Tämä toiminto ohittaa roskakorin. Tätä toimintoa ei voi perua.";
"Execute delete with root privileges" = "Suorita root-käyttäjänä";
"Normal Delete" = "Poista normaalisti";
"Secure Delete" = "Silppua";
"%d Applications" = "%d Applications";
"Extension" = "Extension";
"Convert Image" = "Muunna kuvatiedosto";
"Disk Usage" = "Levyn käyttö";

"Do you want to force %@ to quit?" = "Haluatko pakottaa %@ lopettamaan?";
"You will lose any unsaved changes." = "Kaikki tallentamattomat muutokset menetetään.";
"Force Quit" = "Pakota lopettamaan";

"Burn" = "Polta";
"Burning %@ disc" = "Poltetaan %@ levyä";
"Hybrid" = "Hybrid";
"HFS+" = "HFS+";
"ISO 9660" = "ISO 9660";
"Joliet" = "Joliet";
"Audio" = "Audio";

/* Find window */
"Not Specified" = "Ei määritelty";
"Found: %d" = "Löytyi: %d";
"All" = "Kaikki";

"Today" = "Tänään";
"the last 2 days" = "viimeisenä 2 päivänä";
"the last 3 days" = "viimeisenä 3 päivänä";
"the last week" = "viimeisen viikon aikana";
"the last 2 weeks" = "kahden viime viikon aikana";
"the last 3 weeks" = "kolmen viime viikon aikana";
"the last month" = "viimeisen kuukauden aikana";
"the last 2 months" = "kahden viimeisen kuukauden aikana";
"the last 3 months" = "kolmen viimeisen kuukauden aikana";
"the last 6 months" = "viimeisen puolen vuoden aikana";
"the last year" = "viimeisen vuoden aikana";

"Find by" = "Hakuperuste";
"Find by Name" = "Etsi nimen mukaan";
"Find by Content" = "Etsi sisällön mukaan";
"Search Locations" = "Etsi paikoista";

"Partial match" = "Vastaa osittain";
"Exact match" = "Vastaa tarkalleen";
"Starts with" = "Alkaa";
"Ends with" = "Loppuu";

"Search inside packages" = "Etsi pakkausten sisältä";
"Search inside the System folder" = "Etsi Järjestelmäkansiosta";

"Security Level" = "Turvallisuusaste";
"Simple Security (1 pass)" = "Yksinkertainen (1 kerta)";
"Medium Security (7 passes)" = "Keskitaso (7 kertaa)";
"Ultra Security (35 passes)" = "Erittäin varma (35 kertaa)";

"Burning Disk Image" = "Poltetaan levytiedostoa";
"Burning:" = "Poltetaan:";
"Eject disc after burning" = "Poista levy polton jälkeen";
"Verify disc after burning" = "Varmista levy polton jälkeen";

"Play" = "Toista";
"Parent" = "Ylempi taso";

"Greater than" = "Suurempi kuin";
"Less than" = "Pienempi kuin";
"Visibility:" = "Näkyvyys:";
"Visible" = "Näkyvissä";
"Invisible" = "Näkymätön";
"Content:" = "Sisältö";
"Extension:" = "Tarkenne:";
"Label:" = "Merkki:";

"Document" = "Dokumentti";
"Folder" = "Kansio";
"Application" = "Ohjelma";
"Audio" = "Ääni";
"Image" = "Kuva";
"Movie" = "Elokuva";
"PDF" = "PDF";
"Alias" = "Alias";
"Sample" = "Näyte";
"%d seconds" = "%d sekuntia";
"Duration:" = "Kesto:";

"Find results incomplete." =  "Hakutulokset keskeneräisiä.";
"Mac OS X will halt a find operation if the disk is modified during the search.  For complete results, try again." =  "Mac OS X keskeyttää toiminnon, mikäli levyä muutetaan kesken haun. Tarkempien hakutulosten saamiseksi yritä uudelleen.";

"untitled" = "nimetön";
"Path Drawer" = "Polkuikkuna";

/* Screen Capture Panel */
"Screen Capture" = "Kuvakaappaus";
"Escape Key:" = "Esc-näppäin:";
"Cancels interactive screen shot mode" = "Peruuttaa interaktiivisen ruutukaappaustilan";
"Space Key:" = "Välilyönti:";
"Toggle between mouse and window selection modes" = "Vaihtaa hiiri- ja ikkunavalintatilojen välillä";
"Control Key:" = "Control-näppäin:";
"Causes screen shot to go to clipboard" = "Ohjaa kuvakaappauksen leikepöydälle";
"Hot keys in screen capture mode" = "Näppäinkomennot kuvakaappaustilassa";
"Selection" = "Valinta";
"Window" = "Ikkuna";
"All monitors" = "Kaikki näytöt";
"Main monitor only" = "Vain päänäyttö";
"Screen capture mode" = "Kuvakaappaustila";
"Play sounds" = "Toista äänet";
"Display screen-shot in Image Converter" = "Näytä kuvakaappaus kuvamuuntajassa";
"Save screen-shot to file" = "Tallenna kuvakaappaus tiedostoon";
"Save screen-shot to clipboard" = "Tallenna kuvakaappaus leikepöydälle";

"Resource Fork" = "Resurssihaarukka";
"Data Fork" = "Datahaarukka";
"Recent Servers" = "Äskeiset palvelimet";
"URL:" = "URL:";

"Man Pages" = "Man-sivut";

"Connect To iDisk" = "Yhdistä iDiskiin";
"To connect to an iDisk, enter a .Mac member name and password." = "Syötä .Mac-jäsennimi ja salasana yhdistääksesi iDiskiin.";
"Member name:" = "Jäsennimi:";
"Password:" = "Salasana:";
"Connect To iDisk Public Folder" = "Yhdistä iDiskin julkiseen kansioon";
"To connect to the Public folder for a .Mac member, enter the member's account name." = "Yhdistääksesi .Mac-jäsenen julkiseen kansioon, syötä jäsenen käyttäjänimi.";
"Address:" = "Osoite:";  /* Server Address URL */

"Erase" = "Erase";
